clc;
clear;
%注释1为FIFO
%注释2为排序和循环100次用于统计

N=10;%任务数量
%Task=zeros(7,N);
Task1=[2 5 7 4 9 3 5 10 13 6;%weight
    1 2 1 3 2 4 1 5 3 6;%a
    5 10 3 9 8 16 6 30 6 12;%b
    0.09 0.21 0.21 0.06 0.03 0.15 0.3 0.09 0.18 0.06%c
    ];
% Task=[12	14	5	11	10	2	7	5	11	5
% 3	3	6	1	6	2	5	4	5	3
% 15	15	36	4	12	12	30	12	20	18
% 0.173027489	0.007757241	0.133959293	0.193890587	0.156360886	0.111693798	0.2811404	0.248859847	0.254725644	0.111760272
% ];
for j=5:10
    for k=1:100
    tic
    Task=Task1(:,1:j);
%     Task=sortrows(Task',-1)';
    for i=1:10%2排序后执行
    opx=0.7;
    opw=0;
%     group=1:j;%1先进先出的顺序执行
%     [returnf]=DP(group,Task,opx);%1先进先出的顺序执行
    [ReOps,Result,ReGroup]=Allocate(Task,opx);%2排序后执行
    sumff(i)=Result(10);%2排序后执行
    end%2排序后执行
    tim(j-4,k)=toc;
    end
end